In [4]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/datasets_projeto_DIO/Gapminder.csv', error_bad_lines=False, sep=';')
df.rename(columns={'country': 'País', 'continent': 'Continente', 'year': 'Ano', 'lifeExp': 'Expectativa de vida', 'pop': 'População', 'gdpPercap': 'PIB per capta'}, inplace=True)

             País Continente  ...  População  PIB per capta
0     Afghanistan       Asia  ...    8425333     779.445314
1     Afghanistan       Asia  ...    9240934     820.853030
2     Afghanistan       Asia  ...   10267083     853.100710
3     Afghanistan       Asia  ...   11537966     836.197138
4     Afghanistan       Asia  ...   13079460     739.981106
...           ...        ...  ...        ...            ...
3307     Zimbabwe     Africa  ...    9216418     706.157306
3308     Zimbabwe     Africa  ...   10704340     693.420786
3309     Zimbabwe     Africa  ...   11404948     792.449960
3310     Zimbabwe     Africa  ...   11926563     672.038623
3311     Zimbabwe     Africa  ...   12311143     469.709298

[3312 rows x 6 columns]

In [45]:
#Mostrar as 5 primeiras linhas do dataframe:
df.head()

    Cidade       Data  Vendas LojaID  Qtde
0  Aracaju 2018-01-01  142.00   1520     1
1  Aracaju 2018-01-01   14.21   1522     6
2  Aracaju 2018-01-01   71.55   1520     1
3  Aracaju 2018-01-01    3.01   1521     7
4  Aracaju 2018-01-01   24.51   1522     8

In [46]:
#Mostras as n primeiras linhas de um dataframe, onde n é passado como parâmetro para a função head():
#Para n = 15:
df.head(15)

     Cidade       Data  Vendas LojaID  Qtde
0   Aracaju 2018-01-01  142.00   1520     1
1   Aracaju 2018-01-01   14.21   1522     6
2   Aracaju 2018-01-01   71.55   1520     1
3   Aracaju 2018-01-01    3.01   1521     7
4   Aracaju 2018-01-01   24.51   1522     8
5   Aracaju 2018-01-01  156.20   1522     1
6   Aracaju 2018-01-01   35.50   1522     2
7   Aracaju 2019-01-01  172.22   1522     6
8   Aracaju 2019-01-01   12.16   1523     1
9   Aracaju 2019-01-01  149.36   1523     3
10  Aracaju 2019-01-01   42.34   1522     6
11  Aracaju 2019-01-01  161.53   1520     4
12  Aracaju 2019-01-01    9.78   1520     8
13  Aracaju 2018-01-01   43.45   1522    10
14  Aracaju 2018-01-01  148.21   1521     3

In [47]:
#Exibir as 5 últimas linhas do dataframe:
df.tail()

       Cidade       Data  Vendas LojaID  Qtde
235  Salvador 2019-01-03   41.84   1034     1
236  Salvador 2019-01-03  126.29   1035     3
237  Salvador 2019-01-03   38.06   1036     3
238  Salvador 2019-01-03  139.64   1035     1
239  Salvador 2019-01-03  161.41   1037     3

In [48]:
#Exbir as 9 últimas linhas do dataframe:
df.tail(9)

       Cidade       Data  Vendas LojaID  Qtde
231  Salvador 2019-01-03   89.85   1034     2
232  Salvador 2019-01-03  167.76   1034     3
233  Salvador 2019-01-03  172.40   1036     2
234  Salvador 2019-01-03   48.39   1035     2
235  Salvador 2019-01-03   41.84   1034     1
236  Salvador 2019-01-03  126.29   1035     3
237  Salvador 2019-01-03   38.06   1036     3
238  Salvador 2019-01-03  139.64   1035     1
239  Salvador 2019-01-03  161.41   1037     3

In [5]:
#Filtro:
oceania = df.loc[df.Continente == 'Oceania']
oceania

                 País Continente  ...  População  PIB per capta
975              Fiji    Oceania  ...     421869    2039.393277
976              Fiji    Oceania  ...     485000    2170.073285
977              Fiji    Oceania  ...     544000    2797.759484
978              Fiji    Oceania  ...     599339    3182.569600
979              Fiji    Oceania  ...     658906    3209.257468
...               ...        ...  ...        ...            ...
2696  Solomon Islands    Oceania  ...     300694    1783.648762
2697  Solomon Islands    Oceania  ...     358713    2109.894257
2698  Solomon Islands    Oceania  ...     424265    2252.491044
2699  Solomon Islands    Oceania  ...     494786    1530.496068
2700  Solomon Islands    Oceania  ...     566842    1829.317402

[74 rows x 6 columns]

In [64]:
#Exibir as dimensões do dataframe:
df.shape #894 linha e 5 colunas

(894, 5)

In [9]:
#Groupby:
print('Número de países por continente:')
df.groupby('Continente')['País'].nunique()

Número de países por continente:

Continente
Africa      51
Americas    25
Asia        41
Europe      35
FSU          6
Oceania      3
Name: País, dtype: int64

In [ ]:
#Espectativa de vida média para cada país da base de dados:
print('Espectativa de vida média para cada país:')
df.groupby('Ano')['Expectativa de vida'].mean()

In [15]:
#Para arquivos do Excel:
df1 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Aracaju.xlsx')
df2 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Fortaleza.xlsx')
df3 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Natal.xlsx')
df4 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Recife.xlsx')
df5 = pd.read_excel('/content/drive/MyDrive/datasets_projeto_DIO/Salvador.xlsx')

In [20]:
df = pd.concat([df1, df2, df3, df4, df5])
df

       Cidade       Data  Vendas  LojaID  Qtde
0     Aracaju 2018-01-01  142.00    1520     1
1     Aracaju 2018-01-01   14.21    1522     6
2     Aracaju 2018-01-01   71.55    1520     1
3     Aracaju 2018-01-01    3.01    1521     7
4     Aracaju 2018-01-01   24.51    1522     8
..        ...        ...     ...     ...   ...
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

[894 rows x 5 columns]

In [50]:
#Pegar uma amostra aleatória de n elementos do dataframe:
#Para n = 20:
df.sample(20)

        Cidade       Data  Vendas LojaID  Qtde
135     Recife 2019-03-02   10.79    983     5
102  Fortaleza 2019-01-01   13.99   1004     3
233   Salvador 2019-01-03  172.40   1036     2
25    Salvador 2019-01-01  220.62   1035     1
6     Salvador 2019-01-01   36.30   1034     2
144      Natal 2019-01-02   23.38   1034     1
70    Salvador 2019-01-01   39.06   1034     3
114      Natal 2019-01-02   25.52   1034     1
129    Aracaju 2018-01-01   13.70   1522     6
11     Aracaju 2019-01-01  161.53   1520     4
59     Aracaju 2018-01-01   15.07   1523     7
134     Recife 2019-03-02  195.18    980     5
179   Salvador 2019-01-02   64.95   1036     1
22   Fortaleza 2019-01-01  150.32   1005     1
2      Aracaju 2018-01-01   71.55   1520     1
114   Salvador 2019-03-02   25.52   1034     1
77   Fortaleza 2019-01-01  167.64   1005     1
98   Fortaleza 2019-01-01   15.00   1005     2
9        Natal 2018-05-02  261.00    852     3
82       Natal 2019-03-07  868.00    854     3

In [23]:
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [28]:
df.LojaID = df.LojaID.astype('object')
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [44]:
#Verificação de valores nulos por coluna:
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [68]:
#Subustituição de valores nulos:
#df.fillna(selecao_coluna e atribuicao_valor, inplace=True)

In [69]:
#Apagar todas as linhas que contenham valores nulos em pelo menos uma coluna do dataframe:
df.dropna(inplace=True)

In [72]:
#Apagar todas as linhas com valores nulos de uma coluna específica:
#df.dropna(subset=['nome_da_coluna'], inplace=True)
df.dropna(subset=['Vendas'], inplace=True)

In [76]:
#Apagar linhas que apresentam valores nulos para todas as colunas - apaga a linha na qual todos os valores são nulos
df.dropna(how='all', inplace=True)

In [83]:
#Criação de uma nova coluna no dataframe:
#df['nome_nova_coluna'] = definição_genérica_do_valor_de_cada_linha ou
df['Receita'] = df.Vendas.mul(df.Qtde)
df

       Cidade       Data  Vendas LojaID  Qtde  Receita
0     Aracaju 2018-01-01  142.00   1520     1   142.00
1     Aracaju 2018-01-01   14.21   1522     6    85.26
2     Aracaju 2018-01-01   71.55   1520     1    71.55
3     Aracaju 2018-01-01    3.01   1521     7    21.07
4     Aracaju 2018-01-01   24.51   1522     8   196.08
..        ...        ...     ...    ...   ...      ...
235  Salvador 2019-01-03   41.84   1034     1    41.84
236  Salvador 2019-01-03  126.29   1035     3   378.87
237  Salvador 2019-01-03   38.06   1036     3   114.18
238  Salvador 2019-01-03  139.64   1035     1   139.64
239  Salvador 2019-01-03  161.41   1037     3   484.23

[894 rows x 6 columns]

In [84]:
#Maior elemeneto de uma coluna:
#df['nome_coluna'].max() ou
#df.nome_coluna.max()

#Maior receita do dataframe:
df.Receita.max()

3544.0

In [86]:
#Menor elemeneto de uma coluna:
#df['nome_coluna'].min() ou
#df.nome_coluna.min()

#Menor receita do dataframe:
df.Receita.min()

3.34

In [87]:
#Exibir as n linhas com os maiores valores de uma coluna:
#df.nlargest(n, nome_coluna)
df.nlargest(3, 'Receita')

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [88]:
#Exibir as n linhas com os menores valores de uma coluna:
#df.nsmallest(n, nome_coluna)
df.nsmallest(3, 'Receita')

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [89]:
#Agrupamento da receita por cidade:
df.groupby('Cidade').Receita.sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [90]:
#Ordenação de valores:
#df.sort_values('nome_coluna', ascending=[True | False]) #se ascending=True: ordem crescente; se ascending=False: ordem decrescente
df.sort_values('Receita', ascending=False).head()

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
55  Natal 2019-01-08   859.0    854     4   3436.0
51  Natal 2018-01-21   859.0    852     4   3436.0
30  Natal 2018-10-02   856.0    853     4   3424.0
41  Natal 2018-05-20   835.0    852     4   3340.0